VPro/src/Catalogs/ProductsAndServicesCategories/ProductsAndServicesCategories.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProductsAndServicesCategories</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>WithoutCategory</name>
      <description>Nhóm sản phẩm chính</description>
    </items>
  </predefined>
  <attributes>
    <name>CharacteristicPropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AlcoholicProductsKind</name>
    <type>
      <types>CatalogRef.AlcoholicProductsKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecificationAttributesArray</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <tabularSections>
    <name>SortingOrder</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Enums/ProductsAndServicesTypes/ProductsAndServicesTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductsAndServicesTypes</name>
  <enumValues>
    <name>InventoryItem</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
  <enumValues>
    <name>Work</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>WorkKind</name>
  </enumValues>
  <enumValues>
    <name>DeleteExpense</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/ProductsAndServices/ProductsAndServices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProductsAndServices</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AlcoholicProductsKind</name>
    <type>
      <types>CatalogRef.AlcoholicProductsKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>AlcoholicProductsManufacturerImporter</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessActivity</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CountryOfOrigin</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteAlcoholicProductsManufacturerImporter</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteFileImages</name>
    <type>
      <types>CatalogRef.Files</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteVolumeDAL</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EstimationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpensesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteePeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>MeasurementUnit</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderCompletionDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PictureFile</name>
    <type>
      <types>CatalogRef.ProductsAndServicesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceGroup</name>
    <type>
      <types>CatalogRef.PriceGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsAndServicesCategory</name>
    <type>
      <types>CatalogRef.ProductsAndServicesCategories</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsAndServicesType</name>
    <type>
      <types>EnumRef.ProductsAndServicesTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentMethod</name>
    <type>
      <types>EnumRef.InventoryReplenishmentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeleteSpecification</name>
    <type>
      <types>CatalogRef.Specifications</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeNorm</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseBatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSerialNumbers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>VolumeDAL</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOutTheGuaranteeCard</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CommodityFEAProductsAndServices</name>
    <type>
      <types>CatalogRef.TNFEAClassifier</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/ChartsOfCharacteristicTypes/AdditionalAttributesAndInformation/AdditionalAttributesAndInformation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>AdditionalAttributesAndInformation</name>
  <type>
    <types>CatalogRef.Currencies</types>
    <types>CatalogRef.ObjectsPropertiesValues</types>
    <types>CatalogRef.ProductsAndServices</types>
    <types>CatalogRef.ObjectsPropertiesValuesHierarchy</types>
    <types>Boolean</types>
    <types>CatalogRef.Individuals</types>
    <types>String</types>
    <types>CatalogRef.Users</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Counterparties</types>
    <types>CatalogRef.Projects</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>ThisIsAdditionalInformation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FillObligatory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MultilineTextBox</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesAreUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesOwner</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesWithWeight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ValueFormHeader</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValueChoiceFormHeader</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormatProperties</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Visible</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisplayAsHyperlink</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Available</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributeDependencies</name>
    <attributes>
      <name>DependentProperty</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>PropertySet</name>
      <type>
        <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Presentations</name>
    <attributes>
      <name>LanguageCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ToolTip</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueFormHeader</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValueChoiceFormHeader</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

VPro/src/Catalogs/ProductsAndServicesCategories/Forms/ItemForm/Module.bsl
&AtClient
Var SortingOrderChanged; 

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
//	If Not ValueIsFilled(Object.Ref) Then
//		FillTypesList();
//	EndIf;
//	
//	If Not Constants.FunctionalOptionUseTechOperations.Get() Then
//		FoundOperation = Items.ТипНоменклатурыПоУмолчанию.ChoiceList.FindByValue(Enums.ProductsAndServicesTypes.Operation);
//		If FoundOperation <> Undefined Then
//			Items.ТипНоменклатурыПоУмолчанию.ChoiceList.Delete(FoundOperation);
//		EndIf;
//	EndIf;
	
	MetadataObject = Catalogs.ProductsAndServices.EmptyRef().Metadata();
	ProductsAndServicesEditAllowed =
		SmallBusinessAccessManagementReUse.HasAccessRight(
			"Insert",
			CommonUse.MetadataObjectID(MetadataObject))
		Or SmallBusinessAccessManagementReUse.HasAccessRight(
			"Update", 
			CommonUse.MetadataObjectID(MetadataObject));
	
	SetFieldForSortingSign(); 
	
	If Not Constants.FunctionalOptionUseCharacteristics.Get() Then
		Items.GroupCharacteristics.Visible = False;
	EndIf;
	
	FOUseSubsystemProduction = GetFunctionalOption("UseSubsystemProduction");
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	FillAdditionalAttributesList();
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	PropertiesSetObject = Object.PropertySet.GetObject();
	TabSec = PropertiesSetObject.AdditionalAttributes;
	IndexOf = 0;
	For Each Property In ProductsAndServicesProperty Do
		
		Row = TabSec.Find(Property.Ref, "Property");
		TabSec.Move(Row, IndexOf - TabSec.IndexOf(Row));
		IndexOf = IndexOf + 1;
		
	EndDo;
	PropertiesSetObject.Write();
	
	PropertiesSetObject = Object.CharacteristicPropertySet.GetObject();
	TabSec = PropertiesSetObject.AdditionalAttributes;
	IndexOf = 0;
	For Each Property In CharacteristicProperties Do
		
		Row = TabSec.Find(Property.Ref, "Property");
		TabSec.Move(Row, IndexOf - TabSec.IndexOf(Row));
		IndexOf = IndexOf + 1;
		
	EndDo;
	PropertiesSetObject.Write();
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	If SortingOrderChanged Then
		Notify("OrderChanged", Object.Ref);
	EndIf;
	
	Notify("Write_ProductsAndServicesCategory ", Object.Ref);
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters) 
	
	SortingOrderChanged = False;
	CurrentPropertiesArray = New Array;
	
	For Each SortingLine In Object.SortingOrder Do
		CurrentPropertiesArray.Add(SortingLine.Property);
	EndDo;
	
	Object.SortingOrder.Clear();
	
	For Each TableRowCharacteristicProperties In CharacteristicProperties Do
		If TableRowCharacteristicProperties.Sort
			Then
			NewRow = Object.SortingOrder.Add();
			NewRow.Property = TableRowCharacteristicProperties.Ref;
			
			SortingOrderChanged = ?(CurrentPropertiesArray.Find(NewRow.Property) = Undefined, True, False);        
		EndIf;
	EndDo;
	
	If Not SortingOrderChanged And Not CurrentPropertiesArray.Count() = Object.SortingOrder.Count()
		Then
		SortingOrderChanged = True;
	EndIf;
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "ValueChangeUseCharacteristics" Then
		Items.GroupCharacteristics.Visible = Parameter
	EndIf;
	
	If EventName = "Writing_AdditionalAttributesAndInformationSets" Or EventName = "Writing_AdditionalAttributesAndInformation" Then
		FillAdditionalAttributesList();
	EndIf;
	
EndProcedure

#EndRegion

#Region ProductsAndServicesPropertiesFormTableEventHandlers

&AtClient
Procedure ProductsAndServicesPropertyOnChange(Item)
	
	Modified = True;
	
EndProcedure

&AtClient
Procedure ProductsAndServicesPropertySelection(Item, SelectedRow, Field, StandardProcessing)
	
	StandardProcessing = False;
	AdditionalAttributesTableRowSelect(Item.CurrentData.Ref);
	
EndProcedure

&AtClient
Procedure ProductsAndServicesPropertyBeforeAddRow(Item, Cancel, Copy, Parent, Group, Parameter)
	
	Cancel = True;
	AddAdditionalAttribute("ProductsAndServices");
	
EndProcedure

&AtClient
Procedure ProductsAndServicesPropertyBeforeRowChange(Item, Cancel)
	
	AdditionalAttributesTableRowSelect(Item.CurrentData.Ref);
	Cancel = True;
	
EndProcedure

&AtClient
Procedure ProductsAndServicesPropertyBeforeDeleteRow(Item, Cancel)
	
	For Each RemovedRow In Item.SelectedRows Do
		PropertyToDelete = ProductsAndServicesProperty.FindByID(RemovedRow).Ref;
		ProductsAndServicesPropertyBeforeDeleteRowAtServer(PropertyToDelete);
	EndDo;
	
EndProcedure

&AtServer
Procedure ProductsAndServicesPropertyBeforeDeleteRowAtServer(PropertyToDelete)
	
	PropertiesSetObject = Object.PropertySet.GetObject();
	TabSec = PropertiesSetObject.AdditionalAttributes;
	Row = TabSec.Find(PropertyToDelete, "Property");
	TabSec.Delete(Row);
	PropertiesSetObject.Write();
	
EndProcedure

&AtClient
Procedure ProductsAndServicesPropertyChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	ProductsAndServicesPropertyChoiceProcessingAtServer(SelectedValue);
	Modified = True;
	FillPropertyListOfCurrentSet("ProductsAndServices");
	
EndProcedure

&AtServer
Procedure ProductsAndServicesPropertyChoiceProcessingAtServer(ArraySelectedValues)
	
	For Each SelectedValue In ArraySelectedValues Do
		
		If SelectedValue.PropertySet <> Object.PropertySet
			And SelectedValue.PropertySet = Object.CharacteristicPropertySet Then
			
			SelectedValueObject = SelectedValue.GetObject();
			SelectedValueObject.PropertySet = Object.CharacteristicPropertySet;
			SelectedValueObject.Write();
			
		EndIf;
		
		PropertiesSetObject = Object.PropertySet.GetObject();
		TabSec = PropertiesSetObject.AdditionalAttributes;
		Row = TabSec.Add();
		Row.Property = SelectedValue;
		PropertiesSetObject.Write();
	EndDo;
	
EndProcedure

#EndRegion

#Region CharacteristicPropertiesFormTableEventHandlers

&AtClient
Procedure CharacteristicPropertiesOnChange(Item)
	
	Modified = True;
	
EndProcedure

&AtClient
Procedure CharacteristicPropertiesSelection(Item, SelectedRow, Field, StandardProcessing)
	
	StandardProcessing = False;
	AdditionalAttributesTableRowSelect(Item.CurrentData.Ref);
	
EndProcedure

&AtClient
Procedure CharacteristicPropertiesBeforeAddRow(Item, Cancel, Copy, Parent, Group, Parameter)
	
	Cancel = True;
	AddAdditionalAttribute("Characteristics");
	
EndProcedure

&AtClient
Procedure CharacteristicPropertiesBeforeRowChange(Item, Cancel)
	
	If Not Item.CurrentItem.Name = "CharacteristicPropertiesSort" 
		Then	
		AdditionalAttributesTableRowSelect(Item.CurrentData.Ref);
		Cancel = True;
	EndIf;
	
EndProcedure

&AtClient
Procedure CharacteristicPropertiesBeforeDeleteRow(Item, Cancel)
	
	PropertyToDelete = Item.CurrentData.Ref;
	CharacteristicPropertiesBeforeDeleteRowAtServer(PropertyToDelete);
		
EndProcedure

&AtServer
Procedure CharacteristicPropertiesBeforeDeleteRowAtServer(PropertyToDelete)

	PropertiesSetObject = Object.CharacteristicPropertySet.GetObject();
	TabSec = PropertiesSetObject.AdditionalAttributes;
	Row = TabSec.Find(PropertyToDelete, "Property");
	
	If Not Row = Undefined Then
		TabSec.Delete(Row);
		PropertiesSetObject.Write();
	EndIf;
	
	FilterParameters = New Structure("Property", PropertyToDelete);
	
	SortingRows = Object.SortingOrder.FindRows(FilterParameters);
	
	For Each SortingLine In SortingRows Do
		Object.SortingOrder.Delete(SortingLine);
	EndDo;

EndProcedure

&AtClient
Procedure CharacteristicPropertiesChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	CharacteristicPropertiesChoiceProcessingAtServer(SelectedValue);
	Modified = True;
	FillPropertyListOfCurrentSet("Characteristics");
	
EndProcedure

&AtServer
Procedure CharacteristicPropertiesChoiceProcessingAtServer(ArraySelectedValues)
	
	For Each SelectedValue In ArraySelectedValues Do
		
		If SelectedValue.PropertySet = Object.PropertySet
			And SelectedValue.PropertySet <> Object.CharacteristicPropertySet Then
			
			SelectedValueObject = SelectedValue.GetObject();
			SelectedValueObject.PropertySet = Object.CharacteristicPropertySet;
			SelectedValueObject.Write();
			
		EndIf;
		
		PropertiesSetObject = Object.CharacteristicPropertySet.GetObject();
		TabSec = PropertiesSetObject.AdditionalAttributes;
		Row = TabSec.Add();
		Row.Property = SelectedValue;
		PropertiesSetObject.Write();
	EndDo;
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Procedure FillTypesList()
	
	List = Items.DefaultProductsAndServicesType.ChoiceList;
	
	ProductAndServicesTypeRestriction = Undefined;
	Parameters.FillingValues.Property("ProductsAndServicesType", ProductAndServicesTypeRestriction);
	
	If Not ProductAndServicesTypeRestriction = Undefined Then
		If (TypeOf(ProductAndServicesTypeRestriction) = Type("Array") Or TypeOf(ProductAndServicesTypeRestriction) = Type("FixedArray")) 
			And ProductAndServicesTypeRestriction.Count() > 0 Then
			
			List.Clear();
			For Each Type In ProductAndServicesTypeRestriction Do
				List.Add(Type);
			EndDo;
			
		ElsIf TypeOf(ProductAndServicesTypeRestriction) = Type("EnumRef.ProductsAndServicesTypes") Then
			
			List.Clear();
			List.Add(ProductAndServicesTypeRestriction);
			
		EndIf;
		
	EndIf;
	
	If Not Constants.FunctionalOptionUseTechOperations.Get() Then
		FoundOperation = Items.DefaultProductsAndServicesType.ChoiceList.FindByValue(Enums.ProductsAndServicesTypes.Operation);
		If FoundOperation <> Undefined Then
			Items.DefaultProductsAndServicesType.ChoiceList.Delete(FoundOperation);
		EndIf;
	EndIf;
	
	If Items.DefaultProductsAndServicesType.ChoiceList.FindByValue(Object.DefaultProductsAndServicesType) = Undefined Then
		Object.DefaultProductsAndServicesType = List.Get(0).Value;
	EndIf;
	
	If List.Count() = 1 Then
		Items.DefaultProductsAndServicesType.Enabled = False;
	EndIf;
	
EndProcedure

&AtServer
Function TypeOfAdditionalAttributeContainsPropertyValues(ValueType)
	
	Return ValueType.ContainsType(Type("CatalogRef.ObjectsPropertiesValues"))
		Or ValueType.ContainsType(Type("CatalogRef.ObjectsPropertiesValuesHierarchy"));
	
EndFunction

&AtServer
Function ThisIsAdditionalInformation(AttributeType)
	
	If AttributeType.Types().Find(Type("CatalogRef.ObjectsPropertiesValues")) <> Undefined Then
		Return True;
	Else
		Return False;
	EndIf;
	
EndFunction

&AtServer
Procedure FillPropertyListOfCurrentSet(ItemSetOwner)
	
	If ItemSetOwner = "ProductsAndServices" Then
		PropertySet = Object.PropertySet;
		Table = ProductsAndServicesProperty;
	ElsIf ItemSetOwner = "Characteristics" Then
		PropertySet = Object.CharacteristicPropertySet;
		Table = CharacteristicProperties;
	EndIf;
	
	Table.Clear();
	
	Query = New Query;
	Query.SetParameter("PropertySet", PropertySet);
	Query.Text = 
	"SELECT
	|	AddAttributes.Property AS Ref,
	|	AddAttributes.LineNumber AS LineNumberForSorting
	|FROM
	|	Catalog.AdditionalAttributesAndInformationSets.AdditionalAttributes AS AddAttributes
	|WHERE
	|	AddAttributes.Ref = &PropertySet
	|";
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		
		NewRow = Table.Add();
		NewRow.Ref = Selection.Ref;
		NewRow.Title = Selection.Ref.Title;
		
		If TypeOfAdditionalAttributeContainsPropertyValues(Selection.Ref.ValueType) Then
			
			NewRow.ValueType = String(New TypeDescription(Selection.Ref.ValueType,,
				"CatalogRef.ObjectsPropertiesValuesHierarchy,CatalogRef.ObjectsPropertiesValues"));
			
			ValuesPresentation = PropertyValuesPresentation(Selection.Ref);
			If ValueIsFilled(NewRow.ValueType) Then
				ValuesPresentation = ValuesPresentation + ", ";
			EndIf;
			
			NewRow.ValueType = ValuesPresentation + NewRow.ValueType;
			
		Else
			
			NewRow.ValueType = String(Selection.Ref.ValueType);
			
		EndIf;
		
	EndDo;
	
EndProcedure

&AtServer
Function PropertyValuesPresentation(AdditionalAttribute)
	
	Query = New Query;
	AdditionalValuesOwner = CommonUse.ObjectAttributeValue(AdditionalAttribute, "AdditionalValuesOwner");
	If ValueIsFilled(AdditionalValuesOwner) Then
		Query.SetParameter("Owner", AdditionalValuesOwner);
	Else
		Query.SetParameter("Owner", AdditionalAttribute);
	EndIf;
	
	Query.Text =
	"SELECT TOP 4
	|	ObjectsPropertiesValues.Description AS Description
	|FROM
	|	Catalog.ObjectsPropertiesValues AS ObjectsPropertiesValues
	|WHERE
	|	ObjectsPropertiesValues.Owner = &Owner
	|	AND NOT ObjectsPropertiesValues.IsFolder
	|	AND NOT ObjectsPropertiesValues.DeletionMark
	|
	|UNION
	|
	|SELECT TOP 4
	|	ObjectsPropertiesValuesHierarchy.Description
	|FROM
	|	Catalog.ObjectsPropertiesValuesHierarchy AS ObjectsPropertiesValuesHierarchy
	|WHERE
	|	ObjectsPropertiesValuesHierarchy.Owner = &Owner
	|	AND NOT ObjectsPropertiesValuesHierarchy.DeletionMark
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	Catalog.ObjectsPropertiesValues AS ObjectsPropertiesValues
	|WHERE
	|	ObjectsPropertiesValues.Owner = &Owner
	|	AND NOT ObjectsPropertiesValues.IsFolder
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	TRUE
	|FROM
	|	Catalog.ObjectsPropertiesValuesHierarchy AS ObjectsPropertiesValuesHierarchy
	|WHERE
	|	ObjectsPropertiesValuesHierarchy.Owner = &Owner";
	ResultsOfQuery = Query.ExecuteBatch();
	
	FirstValues = ResultsOfQuery[0].Unload().UnloadColumn("Description");
	
	If FirstValues.Count() = 0 Then
		If ResultsOfQuery[1].IsEmpty() Then
			ValuesPresentation = NStr("en='Values not yet entered';ru='Значения еще не введены';vi='Chưa nhập các giá trị'");
		Else
			ValuesPresentation = NStr("en='Values marked for deletion';ru='Значения помечены на удаление';vi='Giá trị đã bị đánh dấu xóa'");
		EndIf;
	Else
		ValuesPresentation = "";
		Number = 0;
		For Each Value In FirstValues Do
			Number = Number + 1;
			If Number = 4 Then
				ValuesPresentation = ValuesPresentation + ",...";
				Break;
			EndIf;
			ValuesPresentation = ValuesPresentation + ?(Number > 1, ", ", "") + Value;
		EndDo;
	EndIf;
	
	ValuesPresentation = "<" + ValuesPresentation + ">";
	
	Return ValuesPresentation;
	
EndFunction

&AtServer
Procedure SetFieldForSortingSign()
	
	If Object.SortingOrder.Count()
		Then
		For Each RowSortingOrder In Object.SortingOrder Do
			
			RowWithSorting = CharacteristicProperties.FindRows(New Structure("Ref", RowSortingOrder.Property));
			
			If RowWithSorting.Count()
				Then
				RowWithSorting[0].Sort = True;
			EndIf;
		EndDo;	
		
	EndIf;
	
EndProcedure

&AtServer
Procedure FillAdditionalAttributesList()
	
	FillPropertyListOfCurrentSet("ProductsAndServices");
	FillPropertyListOfCurrentSet("Characteristics");
	
EndProcedure

&AtClient
Procedure AdditionalAttributesTableRowSelect(Property)
	
	FormParameters = New Structure("Key", Property);
	
	OpenForm(
		"ChartOfCharacteristicTypes.AdditionalAttributesAndInformation.Form.ItemForm", 
		FormParameters, 
		ThisForm
	);
	
EndProcedure

&AtClient
Procedure AddAdditionalAttribute(ItemSetOwner)
	
	If Not ValueIsFilled(Object.Ref) Then
		
		QuestionText = NStr("en='Before you start managing properties, you need to write down the object. Write?';ru='Перед началом управления свойствами необходимо записать объект. Записать?';vi='Trước khi bạn bắt đầu quản lý các thuộc tính, cần ghi lại đối tượng. Ghi lại?'");
		Response = Undefined;
		
		AdditionalParameters = New Structure("ItemSetOwner", ItemSetOwner);
		ShowQueryBox(
			New NotifyDescription("AddAdditionalAttributeCompletion", ThisObject, AdditionalParameters),
			QuestionText,
			QuestionDialogMode.YesNo
		);
		
	Else
		
		OpenFormOfSelectedAdditionalAttribute(ItemSetOwner);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure AddAdditionalAttributeCompletion(Result, AdditionalParameters) Export
	
	Response = Result;
	
	If Response = DialogReturnCode.Yes Then
		Write();
	Else
		Return;
	EndIf;
	
	OpenFormOfSelectedAdditionalAttribute(AdditionalParameters.ItemSetOwner);
	
EndProcedure

&AtClient
Procedure OpenFormOfSelectedAdditionalAttribute(ItemSetOwner)
	
	If Not ValueIsFilled(Object.Ref) Then
		Return;
	EndIf;
	
	ThisIsAdditionalInformation = False;
	SelectedAdditionalAttributes = SelectedAdditionalAttributesOfSet(ItemSetOwner);
	
	Filter = New Structure("ThisIsAdditionalInformation", ThisIsAdditionalInformation);
	PropertiesSets = New Array;
	PropertiesSets.Add(Object.PropertySet);
	PropertiesSets.Add(Object.CharacteristicPropertySet);
	Filter.Insert("PropertySet", PropertiesSets);
	
	FormParameters = New Structure;
	FormParameters.Insert("Filter", Filter);
	FormParameters.Insert("MultipleChoice", True);
	FormParameters.Insert("ThisIsAdditionalInformation", ThisIsAdditionalInformation);
	FormParameters.Insert("SelectedValues", SelectedAdditionalAttributes);
	
	If ValueIsFilled(Object.PropertySet) And ItemSetOwner="ProductsAndServices" Then
		FormParameters.Insert("PropertySet", Object.PropertySet);
	ElsIf ValueIsFilled(Object.CharacteristicPropertySet) And ItemSetOwner="Characteristics" Then
		FormParameters.Insert("PropertySet", Object.CharacteristicPropertySet);
	Else
		FormParameters.Insert("PropertySet", PredefinedValue("Catalog.AdditionalAttributesAndInformationSets.Catalog_"+ItemSetOwner));
	EndIf;
	
	ChoiceFormOwner = AdditionalAttributesFormTable(ItemSetOwner);
	
	OpenForm(
		"Catalog.ProductsAndServicesCategories.Form.AdditionalAttributeChoiceForm",
		FormParameters, 
		ChoiceFormOwner,
		UUID
	);
	
EndProcedure

// Функция возвращает массив выбранных доп. реквизитов соответсвующего набора.
//
&AtClient
Function SelectedAdditionalAttributesOfSet(ItemSetOwner)
	
	AdditionalAttributesOfSet = New Array;
	AdditionalAttributeCollection = AdditionalAttributeCollection(ThisForm, ItemSetOwner);
	
	For Each CollectionItem In AdditionalAttributeCollection Do
		AdditionalAttributesOfSet.Add(CollectionItem.Ref);
	EndDo;
	
	Return AdditionalAttributesOfSet;
	
EndFunction

// Функция возвращает таблицу формы - таблицу доп. реквизитов,
// относящуюся к нужному набору.
//
&AtClient
Function AdditionalAttributesFormTable(ItemSetOwner)
	
	If ItemSetOwner = "ProductsAndServices" Then
		Return Items.ProductsAndServicesProperty;
	ElsIf ItemSetOwner = "Characteristics" Then
		Return Items.CharacteristicProperties;
	EndIf;
	
EndFunction

// Функция возвращает коллекцию - таблицу доп. ревизитов,
// относящуюся к нужному набору (набору товаров и услуг, характеристик).
//
&AtClientAtServerNoContext
Function AdditionalAttributeCollection(Form, ItemSetOwner)
	
	If ItemSetOwner = "ProductsAndServices" Then
		Return Form.ProductsAndServicesProperty;
	ElsIf ItemSetOwner = "Characteristics" Then
		Return Form.CharacteristicProperties;
	EndIf;
	
EndFunction

#EndRegion

#Region LibrariesHandlers

// StandardSubsystems.AdditionalReportsAndDataProcessors
&AtClient
Procedure Attachable_ExecuteAssignedCommand(Command)
	If Not AdditionalReportsAndDataProcessorsClient.ExecuteAllocatedCommandAtClient(ThisForm, Command.Name) Then
		ExecutionResult = Undefined;
		AdditionalReportsAndProcessingsExecuteAllocatedCommandAtServer(Command.Name, ExecutionResult);
		AdditionalReportsAndDataProcessorsClient.ShowCommandExecutionResult(ThisForm, ExecutionResult);
	EndIf;
EndProcedure

&AtServer
Procedure AdditionalReportsAndProcessingsExecuteAllocatedCommandAtServer(ItemName, ExecutionResult)
	AdditionalReportsAndDataProcessors.ExecuteAllocatedCommandAtServer(ThisForm, ItemName, ExecutionResult);
EndProcedure
// End StandardSubsystems.AdditionalReportsAndDataProcessors

// StandardSubsystems.Printing
&AtClient
Procedure Attachable_ExecutePrintCommand(Command)
	PrintManagementClient.ExecuteConnectedPrintCommand(Command, ThisObject, Object);
EndProcedure
// End StandardSubsystems.Printing

#EndRegion
